[
  {
    "id": 1,
    "name": "How did I even get here?",
    "notes": "About how I didn't get a good enough rank in JEE ADV to get IIT, and screwed up MHT-CET, MET went surprisingly well without even trying, took CSE at the last moment. I got it in the last round of counseling and even before joining got to know a week before college started that I had to get their book tickets, pack everything I owned, and move to a completely new place with a completely different cuisine and people from all over the world, all over India, and just live alone without my family, without my mom, without my brother, without my dad, without my Mumbai. It was such a drastic shift."
  },
  {
    "id": 2,
    "name": "New Place, New Beginnings",
    "notes": "This is about us having gotten onto the train. My brother didn't come to drop me off to Manipal. My mom and dad had come. In the train itself, we found a huge gang of students who were going there for the first time, a couple of which I'm still really good friends with to date. It's also about how when I got to Manipal, I didn't have a hostel room. And my parents had to go through a bunch of things to get me a room. And finally they got me a wonderful room. And in hindsight, my best friend as well. It's also about how easy yet difficult it was to make new friendships, new impressions in first year. And how it went on about other, how I went on with that."
  },
  {
    "id": 3,
    "name": "My first W in college",
    "notes": "This chapter is about how when I came to college I was a scrawny skeletal boy who would look very much out of place and how in two months I put on a lot of weight and had a glow up in a sense. It's also about how I had started to getting adjusted to this place and started liking it here but of course this happy time was short-lived because I started missing my home again."
  },
  {
    "id": 4,
    "name": "The Student Project Craze",
    "notes": "This is about how I made my first mistake in college, the first time I got hit back to the ground and was told to stay there. It's about the craze of all these different kinds of student projects that went to foreign countries for competitions that made amazing projects, satellites, F1 cars, drones, autonomous moving robots, rovers, cyber security competitions, and how I made a fool of myself by trying to do everything at once, which turns out is a canon event for a lot of students in first year who are just like me."
  },
  {
    "id": 5,
    "name": "My Classmates",
    "notes": "This chapter is about how I made new friends in first year in my class, how it felt to be in computer science branch, how it felt to be called the smartest one based on a small part of your course. It's about how I lost my election as CR in my first year class, but still got to learn so much from a wonderful human being. It's also about how I learned from the forefront, yet from the backseat, of how humans behave in certain situations with one another. It's also about how everyone in my class was from a different family background, different religion, different part of the country, even outside of the country, and how this exposure to different, a diverse amount of people has helped me and degraded me."
  },
  {
    "id": 6,
    "name": "Late Night Studies",
    "notes": "Being a typical good boy and someone who's lived with parents who've had strict sleep times, late night studies or pulling off an all-nighter right before the exams was a new deal for me and how this has become a core part of my memory, one of the biggest bonding moments or experiences with my best friend. And how it's going to be one of the biggest things I'm going to miss but still love not having to do after being done with college. This chapter is about how exams, marks, and college type of marks evaluation hit me for the first time."
  },
  {
    "id": 7,
    "name": "First Year, Last Girlfriend",
    "notes": "Towards a particular holiday in my first year, I happened to find a new girlfriend in Manipal. And this was a girl that I had adored. I was right beside her. And I had learnt from her. She had learnt from me. We were really good friends. We were best friends, in fact. And our relationship grew into something more than that. We started liking each other. And it was a wonderful thing. It was one of the best things that I have gotten out of Manipal. And I will always be grateful to this college. Because I think that if I wasn't here, it wouldn't have been the right place or the right time. So, I feel that me being in this relationship with her is a part of what this college gave me. And something that had a positive effect on me and led me through this entire journey that I had in my college life. She is one of the kindest, most helpful, the most amazing, and the most supportive human beings I have in my life."
  },
  {
    "id": 8,
    "name": "The first Vacation...back home?",
    "notes": "The first long vacation in December was called a vacation but it was ironic because for the first time in my life vacation meant that I got to go back home and this was a very emotional thing at the time for me that I finally got to go back to my home to my comfort zone because I was someone who was attached to my house a lot."
  },
  {
    "id": 9,
    "name": "Going back...away from home",
    "notes": "When 2nd sem started, this time when college started, I realized I wasn't going to come back for a while. It felt weird because going to school only meant that I would get to go back home after lunch. But this felt like grown-up college. It was kind of heartbreaking because it brought me back to the reality that I wasn't home for a long time. The worst part was watching my mom cry as the train left the station to take me back to Manipal."
  },
  {
    "id": 10,
    "name": "First time coding",
    "notes": "In the 2nd semester of college, we had this subject called PSUC — Programming Software Using C. In that subject, we got to learn the language C from scratch, of which I had an idea in 12th standard. But this suddenly became a quick flash of what coding was going to be — a huge part of my life. And I couldn't help but start noticing that I kind of liked the subject — how it pushed me to understand and solve certain problems within given rules and constraints."
  },
  {
    "id": 11,
    "name": "I think I got the hang of this",
    "notes": "About getting comfortable in this new place that has a chance to be a nice house away from home. As the second sem went on, I kind of felt a bit more comfortable being in Manipal. Although it was a house, not a home. But my friend right across my door. Someone I could knock on and run away. Someone I could irritate like my brother. It felt nice. I adjusted. It didn't mean that I didn't miss home. But I just got more used to it. And the more I got used to it, the more I could enjoy the place that I was in, in the present. And Manipal is a beautiful campus."
  },
  {
    "id": 12,
    "name": "Maa ke haath ka khaana",
    "notes": "As the time away from home grew more and more, I started to miss my mom's handmade food, the ghar ka khana, the most. I'm not saying that I didn't miss my parents, my brother, my girlfriend, my friends back home, my house, the lanes I grew up in, the shops I used to buy milk from. But the thing I missed most was the comfort I used to find in the hot steaming dal that my mother would serve me every day for lunch and dinner. Something that meant consistency and comfort. The NSEMs were over, I was back home. And I had my mom cook me food every day for two months."
  },
  {
    "id": 13,
    "name": "Second Year = Second Chance",
    "notes": "New classmates, new branch, new friends to make, new memories to make, new teachers to look up to."
  },
  {
    "id": 14,
    "name": "Finally a CR! but at what cost?",
    "notes": "Uncontested in elections — do you celebrate a W if it was just handed to you? If you didn't have to fight for it?"
  },
  {
    "id": 15,
    "name": "How much coding is too much coding?",
    "notes": "3rd sem — DS, OOP, DSD. It was too much for me."
  },
  {
    "id": 16,
    "name": "Go Big or Go Home... or do both?",
    "notes": "Applying and joining every other club and student project again to gain as much exposure as possible."
  },
  {
    "id": 17,
    "name": "VP election L",
    "notes": "The time I lost the Vice President election — a reality check but also a learning curve."
  },
  {
    "id": 18,
    "name": "Time to focus on myself",
    "notes": "A chapter about realignment — when you realize that maybe the best investment is in yourself."
  },
  {
    "id": 19,
    "name": "Parikshit Satellite - a new kinda W",
    "notes": "The time when I became part of the Parikshit Student Satellite team — a project that changed my college experience completely."
  },
  {
    "id": 20,
    "name": "My web-dev journey",
    "notes": "The start of my web development journey — learning HTML, CSS, and JavaScript and realizing that I loved creating things that people could see and use."
  },
  {
    "id": 21,
    "name": "My First Internship!",
    "notes": "The excitement of landing my first internship, getting to work on real-world projects, and seeing my code make a difference."
  },
  {
    "id": 22,
    "name": "REVELS 24-25 Proshow OC",
    "notes": "Becoming part of the REVELS 24-25 Proshow Organizing Committee — one of the best management experiences of my college life."
  },
  {
    "id": 23,
    "name": "My favorite professor",
    "notes": "Ganesh Babu sir — our DBS professor. A teacher who truly made a difference in how I saw the subject and learning itself."
  },
  {
    "id": 24,
    "name": "A new grind",
    "notes": "DSA and projects because next sem is internship season — the hustle officially began."
  },
  {
    "id": 25,
    "name": "WOW, a second Internship?",
    "notes": "When I managed to secure a second internship — it felt surreal, but also a sign that hard work pays off."
  },
  {
    "id": 26,
    "name": "Microsoft - Holy heartbreak",
    "notes": "The moment when I reached the last round of Microsoft and faced heartbreak — yet a defining point that built resilience."
  },
  {
    "id": 27,
    "name": "Third Year - All eyes on me",
    "notes": "Everyone thinking I was a genius after getting to the last round of Microsoft — the pressure that came with that image."
  },
  {
    "id": 28,
    "name": "Is nazar real? or was I just lucky?",
    "notes": "The self-doubt after rejection crept in, and I wasn't getting shortlisted anywhere. The confusion of wondering if it was luck or merit."
  },
  {
    "id": 29,
    "name": "Pressure? What Pressure?",
    "notes": "The confidence was coming back — I could feel it. The pressure was there, but I was learning to handle it better."
  },
  {
    "id": 30,
    "name": "The Treasurer of Tiddies",
    "notes": "Taking charge as the treasurer of Tiddies — one of the most fun yet responsibility-heavy positions I held."
  },
  {
    "id": 31,
    "name": "Management Head",
    "notes": "Becoming Management Head — taking leadership, managing events, and learning how people really work in teams."
  },
  {
    "id": 32,
    "name": "Henry Wells x William Fargo",
    "notes": "The story of Henry Wells and William Fargo — metaphorically relating to teamwork, vision, and collaboration."
  },
  {
    "id": 33,
    "name": "The Aftermath of WF",
    "notes": "What came after the Wells Fargo project — reflections, learnings, and the realization of what I truly wanted to pursue."
  },
  {
    "id": 34,
    "name": "One More Internship? Please & Thank You.",
    "notes": "A hopeful chapter — still seeking that next internship opportunity, driven by curiosity and the hunger to learn."
  }
]
